Repository: ikus060/udb
Catalog: src/udb/locales/*/LC_MESSAGES/messages.po
Languages: fr

source: Enter a VRF number (optional)
fr: Entrez un numéro VRF (optionnel)

source: L3VNI must be at least %(min)s.
fr: L3VNI doit être au moins %(min)s.

source: L3VNI number.
fr: Numéro L3VNI.

source: L2VNI must be at least %(min)s.
fr: L2VNI doit être au moins %(min)s.

source: L2VNI number.
fr: Numéro L2VNI.

source: VLAN must be at least %(min)s.
fr: VLAN doit être au moins %(min)s.

source: VLAN number.
fr: Numéro du VLAN.

source: %s on %s
fr: %s de %s

source: To create a local user, set a password. To create an external user, validating the password with LDAP, do not set a password.
fr: Pour créer un utilisateur local, définir un mot de passe. Pour créer un utilisateur externe, valider le mot de passe avec LDAP, ne pas définir de mot de passe.

source: Clear password
fr: Effacer le mot de passe

source: Guest - Permissions to view the records
fr: Invité - Permissions de voir les enregistrements

source: User - Permissions to view and edit records
fr: Utilisateur - Permissions de voir et de modifier les enregistrements

source: DNS Zone Manager - Permissions to create a new DNS zone
fr: Gestionnaire de zone DNS - Permissions de créer une nouvelle zone DNS

source: Subnet Manager - Permissions to create new Subnet
fr: Gestionnaire de sous-réseau - Permissions de créer un nouveau sous-réseau

source: Administrator - All permissions including user
fr: Administrateur - Toutes les autorisations, y compris celles de l'utilisateur

source: Enter a VRF name
fr: Saisir un nom de VRF

source: Enter details information about this VRF
fr: Saisir des informations détaillées sur ce VRF

source: Once DHCP reservation have been created for a subnet, it is not possible to update the VRF for this subnet.
fr: Une fois que la réservation DHCP a été créée pour un sous-réseau, il n'est pas possible de mettre à jour la VRF pour ce sous-réseau.

source: Once DHCP reservation have been created for a subnet range, it is not possible to remove that range.
fr: Une fois que la réservation DHCP a été créée pour une plage de sous-réseaux, il n'est pas possible de supprimer cette plage.

source: must be a valid IPv4 or IPv6 address
fr: doit être une adresse IPv4 ou IPv6 valide

source: expected a valid mac
fr: addresse MAC invalide

source: A DHCP Reservation already exists for this MAC address.
fr: Une réservation DHCP existe déjà pour cette adresse MAC.

source: The IP address {obj.ip} is not allowed in any subnet.
fr: L'adresse IP {obj.ip} n'est autorisée dans aucun sous-réseau.

source: Once DHCP reservation have been created for a subnet range, it is not possible to modify that range.
fr: Une fois que la réservation DHCP a été créée pour une plage de sous-réseaux, il n'est pas possible de modifier cette plage.

source: The subnet for this DHCP is currently disabled.
fr: La réservation DHCP est en dehors de la plage DHCP ou DHCP est désactivé.

source: Multiple DHCP Reservation for the same IP address within the same VRF.
fr: Plusieurs réservations DHCP pour la même adresse IP dans le même VRF.

source: Once DNS records have been created for a subnet range, it is not possible to update the VRF for this subnet.
fr: Une fois que les enregistrements DNS ont été créés pour une plage de sous-réseaux, il n'est pas possible de mettre à jour le VRF pour ce sous-réseau.

source: Once DNS records have been created for a subnet range, it is not possible to remove that subnet range.
fr: Une fois que des enregistrements DNS ont été créés pour une plage de sous-réseaux, il n'est pas possible de supprimer cette plage de sous-réseaux.

source: Once DNS records have been created for a subnet, it is not possible to remove the DNS Zone associated with that subnet range.
fr: Une fois que les enregistrements DNS ont été créés pour un sous-réseau, il n'est pas possible de supprimer la zone DNS associée à cette plage de sous-réseaux.

source: Once DNS records have been created for a DNS Zone, it is not possible to remove the subnet associated with that DNS Zone.
fr: Une fois que les enregistrements DNS ont été créés pour une zone DNS, il n'est pas possible de supprimer le sous-réseau associé à cette zone DNS.

source: Can only create reverse DNS Record for PTR, A, AAAA types.
fr: Ne peut créer des enregistrements DNS inversés que pour les types PTR, A, AAAA.

source: value must be a valid IPv4 address
fr: la valeur doit être une adresse IPv4 valide

source: value must be a valid IPv6 address
fr: la valeur doit être une adresse IPv6 valide

source: PTR records must ends with `.in-addr.arpa` or `.ip6.arpa` and define a valid IPv4 or IPv6 address
fr: Les enregistrements PTR doivent se terminer par `.in-addr.arpa` ou `.ip6.arpa` et définir une adresse IPv4 ou IPv6 valide

source: DNS record type not supported.
fr: Type d'enregistrement DNS non pris en charge.

source: Hostname must be defined within a valid DNS Zone.
fr: Le nom d'hôte doit être défini dans une zone DNS valide.

source: You can't change the DNS zone name once you've created a DNS record for it.
fr: Vous ne pouvez pas modifier le nom de la zone DNS une fois que vous avez créé un enregistrement DNS pour elle.

source: The IP address {obj.ip_value} is not allowed in the DNS zone {obj.dnszone_name}. Consider modifying the list of authorized subnets for this zone.
fr: L'adresse IP {obj.ip_value} n'est pas autorisée dans la zone DNS {obj.dnszone_name}. Envisagez de modifier la liste des sous-réseaux autorisés pour cette zone.

source: Once DNS records have been created for a subnet range, it is not possible to modify this range.
fr: Une fois que les enregistrements DNS ont été créés pour une plage de sous-réseaux, il n'est pas possible de modifier cette plage.

source: value must not be empty
fr: la valeur ne doit pas être vide

source: value must be a valid domain name
fr: la valeur doit être un nom de domaine valide

source: SOA record must be defined on DNS Zone.
fr: L'enregistrement SOA doit être défini dans la zone DNS.

source: An SOA record already exist for this domain.
fr: Un enregistrement SOA existe déjà pour ce domaine.

source: The value of the PTR record must be a hostname in a managed DNS zone.
fr: La valeur de l'enregistrement PTR doit être un nom d'hôte dans une zone DNS gérée.

source: PTR record must have at least one corresponding forward record with the same hostname and same IP address.
fr: L'enregistrement PTR doit avoir au moins un enregistrement forward correspondant avec le même nom d'hôte et la même adresse IP.

source: Alias for the canonical name (CNAME) should not be defined on a DNS Zone.
fr: L'alias du nom canonique (CNAME) ne doit pas être défini sur une zone DNS.

source: You cannot define other record type when an alias for a canonical name (CNAME) is defined.
fr: Vous ne pouvez pas définir un autre type d'enregistrement lorsqu'un alias pour un nom canonique (CNAME) est défini.

source: A DNS Zone aready exist for this domain.
fr: Une zone DNS existe déjà pour ce domaine.

source: must be a valid domain name
fr: doit être un nom de domaine valide

source: Enter domain with lower case.
fr: Saisir le domaine en minuscules.

source: expected a valid ipv4 or ipv6
fr: addresse IPv4 ou IPv6 invalide

source: An IP address must be unique within a VRF.
fr: Une adresse IP doit être unique au sein d'un VRF.

source: A MAC address must be unique.
fr: Une adresse MAC doit être unique.

source: your SQL statement should start with SELECT
fr: votre instruction SQL doit commencer par SELECT

source: your SQL statement does not matches the selected data type
fr: votre instruction SQL ne correspond pas au type de données sélectionné

source: your statement returned %s column(s) label as %s, but it's expected to return 2 columns labeled as: %s
fr: votre déclaration renvoie %s colonne(s) étiquetée(s) comme %s, mais elle devrait renvoyer 2 colonnes étiquetées comme : %s

source: does not appear to be a valid IPv6 or IPv4 network
fr: ne semble pas être un réseau IPv6 ou IPv4 valide

source: This IP Range is already defined by another subnet.
fr: Cette plage IP est déjà définie dans un autre sous-réseau.

source: is not a valid RIR status
fr: n'est pas un statut RIR valide

source: at least one IPv6 or IPv4 network is required
fr: au moins un réseau IPv6 ou IPv4 est requis

source: New password cannot be empty.
fr: Le nouveau mot de passe ne peut pas être vide.

source: Password too weak.
fr: Le mot de passe est trop faible.

source: This username already exists.
fr: Ce nom d'utilisateur existe déjà.

source: A user cannot update his own status.
fr: Un utilisateur ne peut pas mettre à jour son propre statut.

source: A user cannot update his own role.
fr: Un utilisateur ne peut pas mettre à jour son propre rôle.

source: A Vrf already exists with the same name.
fr: Il existe déjà un Vrf portant le même nom.

source: Dashboard
fr: Tableau de bord

source: You received this email because you are following changes on these records.
fr: Vous avez reçu cet e-mail parce que vous suivez les modifications de ces enregistrements.

source: Edit notification settings
fr: Paramètres de notification

source: Comment by
fr: Commentaire de

source: Removed:
fr: Supprimé :

source: Added:
fr: Ajouté :

source: Comment on %(model_name)s %(summary)s by %(author_name)s
fr: Commentaire sur %(model_name)s %(summary)s par %(author_name)s

source: modified by
fr: modifié par

source: created by
fr: créé par

source: And %(n)s more changes
fr: Et %(n)s changements supplémentaires

source: View in browser
fr: Voir dans le navigateur

source: Your verification code
fr: Votre code de vérification

source: Hey %(username)s,
fr: Bonjour %(username)s,

source: To help us make sure it's really you, here's the verification code you'll need to log in:
fr: Pour nous aider à nous assurer qu'il s'agit bien de vous, voici le code de vérification dont vous aurez besoin pour vous connecter :

source: If this wasn't you logging in, and you use a password to log in, please reset your password.
fr: Si ce n'est pas vous qui vous êtes connecté et que vous utilisez un mot de passe pour vous connecter, veuillez réinitialiser votre mot de passe.

source: This code will expire in 1 hour. Once the code expires, you will need to request a new verification code by going through the login procedure again.
fr: Ce code expirera dans une heure. Une fois le code expiré, vous devrez demander un nouveau code de vérification en suivant à nouveau la procédure de connexion.

source: Oops!
fr: Oups !

source: Sorry, an error has occured.
fr: Désolé, une erreur s'est produite.

source: Import
fr: Importer

source: Load CSV File
fr: Charger un fichier CSV

source: You may load data from a compatible CSV File format.
fr: Vous pouvez charger des données à partir d'un fichier CSV compatible.

source: Supported format uses commat (,) as separator and double-quote (") for text delimiter.
fr: Ce format utilise la virgule (,) comme séparateur et le guillemet double (") comme délimiteur de texte.

source: Supported column name:
fr: Nom de colonne pris en charge :

source: Load
fr: Chargement

source: Login
fr: Connexion

source: DNS Zone
fr: Zone DNS

source: Subnet
fr: Sous-réseau

source: DNS Record
fr: Enregistrement DNS

source: User
fr: Utilisateur

source: Deployment
fr: Déploiement

source: Environment
fr: Environnement

source: Audit log
fr: Journal d'audit

source: Rule
fr: Règle

source: Undefined
fr: Non défini

source: Two-Factor Authentication is %s for your account. To verify your account, you must enter the code that was sent to your email address.
fr: L'authentification à deux facteurs est %s pour votre compte. Pour vérifier votre compte, vous devez saisir le code qui a été envoyé à votre adresse électronique.

source: Login with a different account
fr: Se connecter avec un autre compte

source: Network
fr: Réseau

source: Setup
fr: Configuration

source: Number of pending changes
fr: Nombre de changements en attente

source: Edit user profile
fr: Profil de l'utilisateur

source: Sign out
fr: Se déconnecter

source: Powered by
fr: Soutenu par

source: Follow changes made on record type
fr: Suivre les modifications apportées à un type d'enregistrement

source: You can select the record type(s) for which you want to receive all notifications.
fr: Vous pouvez sélectionner le(s) type(s) d'enregistrement pour lesquels vous souhaitez recevoir toutes les notifications.

source: Save notification settings
fr: Enregistrer les paramètres de notification

source: Follow changes made on specific record
fr: Suivre les modifications apportées à un enregistrement spécifique

source: Provide a complete list of record that you are following.
fr: Fournis une liste complète des enregistrements que vous suivez.

source: Are you sure you want to stop following all records ?
fr: Êtes-vous sûr de vouloir arrêter de suivre tous les enregistrements ?

source: Unfollow all
fr: Annuler le suivi de tous les enregistrements

source: Subscribed to
fr: Abonnés à

source: You are not following any record.
fr: Vous ne suivez aucun enregistrement.

source: Reset
fr: Réinitialiser

source: Account settings
fr: Paramètres du compte

source: General information about your account.
fr: Informations générales sur votre compte.

source: Save account settings
fr: Sauvegarder les paramètres du compte

source: Change your current password
fr: Modifier votre mot de passe actuel

source: Save password
fr: Enregistrer le mot de passe

source: Two-Factor Authentication
fr: Authentification à deux facteurs

source: You can enhance the security of your account by enabling two-factor authentication (2FA).
fr: Vous pouvez renforcer la sécurité de votre compte en activant l'authentification à deux facteurs (2FA).

source: When enabled, a verification code is sent to your email address each time you log in from a new location to verify that it is you.
fr: Lorsque cette option est activée, un code de vérification est envoyé à votre adresse électronique chaque fois que vous vous connectez à partir d'un nouveau lieu afin de vérifier qu'il s'agit bien de vous.

source: Two-Factor Authentication is <strong>enabled</strong> for your account.
fr: L'authentification à deux facteurs est <strong>activée</strong> pour votre compte.

source: Disable Two-Factor Authentication
fr: Désactiver l'authentification à deux facteurs

source: Two-Factor Authentication is <strong>disabled</strong> for your account.
fr: L'authentification à deux facteurs est <strong>désactivée</strong> pour votre compte.

source: Enable Two-Factor Authentication
fr: Activer l'authentification à deux facteurs

source: Result for:
fr: Résultat pour :

source: All
fr: Tous

source: Summary
fr: Sommaire

source: Model
fr: Modèle

source: Last Modified
fr: Dernière modification

source: Sorry, that filter combination has no result. Please try different criteria.
fr: Désolé, cette combinaison de filtres ne donne aucun résultat. Veuillez essayer d'autres critères.

source: Record
fr: Enregistrement

source: Author
fr: Auteur

source: Created
fr: Créé

source: Modified
fr: Modifié

source: Changes
fr: Modifications

source: Go Back
fr: Retourner

source: Edit
fr: Modifier

source: Describe the reason for the changes or leave a message
fr: Décrire la raison des changements ou laisser un message

source: Save changes
fr: Enregistrer les modifications

source: Toggle Dropdown
fr: Basculer le menu déroulant

source: Save changes and Delete
fr: Enregistrer les modifications et supprimer

source: Save changes and Disable
fr: Enregistrer les modifications et désactiver

source: Save changes and Enable
fr: Enregistrer les modifications et activer

source: Cancel
fr: Annuler

source: History
fr: Historique

source: No history
fr: Pas d'historique

source: Stop following
fr: Se désabonner

source: Start following
fr: S'abbonner

source: Followers:
fr: Abonnés :

source: No followers
fr: Aucun abonné

source: List of
fr: Liste de

source: Permissions required
fr: Permissions requises

source: Create
fr: Créer

source: Show Deleted
fr: Afficher Supprimé

source: Show only mine
fr: Afficher que les miens

source: Download Csv
fr: Télécharger Csv

source: Download Excel
fr: Télécharger Excel

source: Download PDF
fr: Télécharger PDF

source: Export
fr: Exporter

source: Create a new
fr: Créer un nouveau

source: from _START_ to _END_ of _TOTAL_ total
fr: de _START_ à _END_ sur un total de _TOTAL_

source: Show all
fr: Afficher tout

source: Search...
fr: Rechercher...

source: Most active users
fr: Utilisateur les plus actif

source: last 7 days
fr: 7 derniers jours

source: No activities
fr: Aucune activité

source: Last activities
fr: Dernières activités

source: last 10 modifications
fr: 10 dernières modifications

source: No modification
fr: Aucune modification

source: Inconsistencies
fr: Incohérences

source: No inconsistencies were discovered.
fr: Aucune incohérence n'a été décelée.

source: Deployment #
fr: Déploiement #

source: List of changes activated by this deployment.
fr: Liste des changements activés par ce déploiement.

source: No changes activated by this deployment.
fr: Aucune modification activée par ce déploiement.

source: Starting...
fr: Démarrage...

source: Running...
fr: En cours...

source: Success
fr: Réussite

source: Failed
fr: Échec

source: to
fr: à

source: Logs
fr: Journal

source: Recent Deployment
fr: Déploiement récent

source: Starting
fr: Démarrage

source: Running
fr: En cours

source: State
fr: État

source: Started on
fr: Démarré le

source: Number of changes
fr: Nombre de modifications

source: Deployed by
fr: Déployé par

source: Changes never deployed.
fr: Changements jamais déployés.

source: Log
fr: Journal

source: Output of command line executed by this deployment.
fr: Sortie de la ligne de commande exécutée par ce déploiement.

source: Show parent Subnet
fr: Afficher le sous-réseau parent

source: Show related IP
fr: Afficher l'IP associée

source: Show related MAC
fr: Afficher le MAC associé

source: Related DNS Record
fr: Enregistrement DNS associé

source: Show Reverse Record
fr: Afficher l'enregistrement DNS inversé

source: Show Forward Record
fr: Afficher l'enregistrement DNS

source: Create Reverse Record
fr: Créer un enregistrement DNS inverse

source: Create Forward Record
fr: Créer un enregistrement DNS

source: Show parent DNS Zone
fr: Afficher la zone DNS parent

source: No DNS record for the same hostname.
fr: Pas d'enregistrement DNS pour le même nom d'hôte.

source: Download Zone file
fr: Télécharger le fichier de zone

source: Subnet count
fr: Nombre de sous-réseaux

source: DNS Record count
fr: Nombre d'enregistrements DNS

source: Pending Changes
fr: Changements en attente

source: No changes since last deployment.
fr: Aucune modification depuis le dernier déploiement.

source: Create Forward
fr: Créer un enregistrement avant

source: Create Reverse
fr: Créer un enregistrement inverse

source: Create new
fr: Créer nouveau

source: Referenced
fr: Référencement

source: Rule Type
fr: Type de règle

source: Application Rule
fr: Règle d'application

source: Unique Index
fr: Index unique

source: Check Constraint
fr: Contrainte de contrôle

source: Show parent VRF
fr: Afficher le VRF parent

source: Primary IP Range
fr: Plage IP primaire

source: Secondary IP Range(s)
fr: Plage(s) IP secondaire(s)

source: RIR Managed
fr: RIR géré

source: Add row
fr: Ajouter une ligne

source: Remove row
fr: Supprimer la ligne

source: Edit detail
fr: Modifier le détail
