Repository: ikus060/udb
Catalog: src/udb/locales/*/LC_MESSAGES/messages.po
Languages: fr

source: enable debug mode - change the log level to DEBUG, print exception stack trace to the web interface
fr: activer le mode débogage - changer le niveau du journal en DEBUG, imprimer la trace de la pile d'exceptions sur l'interface web

source: configuration file path
fr: chemin du fichier de configuration

source: Define the IP address to listen to. Default: 127.0.0.1
fr: Défini l'adresse IP à écouter. Valeur par défaut : 127.0.0.1

source: Define the port to listen to. Default: 8080
fr: Défini le port à écouter. Valeur par défaut : 8080

source: Define the location of the log file.
fr: Défini l'emplacement du fichier journal.

source: Define the location of the access log file.
fr: Défini l'emplacement du fichier journal d'accès.

source: Define the log level.
fr: Définir le niveau du journal.

source: location where to store user session information and rate-limit information. When undefined, the data are kept in memory.
fr: emplacement où stocker les informations relatives à la session de l'utilisateur et à la limite de débit. Si cet emplacement n'est pas défini, les données sont conservées en mémoire.

source: maximum number of requests per hours that can be made on sensitive endpoint. When this limit is reached, an HTTP 429 message is returned to the user or user get logged out. This security measure is used to limit brute force attacks on the login page and the RESTful API. Default: 20
fr: nombre maximal de requêtes par heure pouvant être effectuées sur un point d'accès sensible. Lorsque cette limite est atteinte, un message HTTP 429 est renvoyé à l'utilisateur ou celui-ci est déconnecté. Cette mesure de sécurité est utilisée pour limiter les attaques par force brute sur la page de connexion. Valeur par défaut : 20

source: Location of the database used for persistence. SQLite and PostgreSQL database are supported officially. To use a SQLite database you may define the location using a file path or a URI. e.g.: /srv/udb/file.db or sqlite:///srv/udb/file.db`. To use PostgreSQL server you must provide a URI similar to postgresql://user:pass@10.255.1.34/dbname and you must install required dependencies. By default, UDB uses a SQLite embedded database located at ./data.db
fr: Emplacement de la base de données utilisée pour la persistance. Les bases de données SQLite et PostgreSQL sont officiellement prises en charge. Pour utiliser une base de données SQLite, vous pouvez définir l'emplacement à l'aide d'un chemin de fichier ou d'un URI. Par exemple /srv/udb/file.db ou sqlite:///srv/udb/file.db`. Pour utiliser le serveur PostgreSQL, vous devez fournir un URI similaire à postgresql://user:pass@10.255.1.34/dbname et vous devez devez installer les dépendances nécessaires. Par défaut, UDB utilise une base de données SQLite intégrée située dans ./data.db

source: administrator username. The administrator user get created on startup if the database is empty.
fr: le nom d'utilisateur de l'administrateur. L'utilisateur administrateur est créé au démarrage si la base de données est vide.

source: administrator encrypted password as SSHA. Read online documentation to know more about how to encrypt your password into SSHA or use http://projects.marsching.org/weave4j/util/genpassword.php When defined, administrator password cannot be updated using the web interface. When undefined, default administrator password is `admin123` and it can be updated using the web interface.
fr: mot de passe crypté de l'administrateur est SSHA. Lisez la documentation en ligne en ligne pour en savoir plus sur la façon de crypter votre mot de passe en SSHA ou utiliser http://projects.marsching.org/weave4j/util/genpassword.php Lorsqu'il est défini, le mot de passe de l'administrateur ne peut pas être mis à jour à l'aide de l'interface web. Lorsqu'il n'est pas défini, le mot de passe administrateur par défaut est `admin123` et il peut être mis à jour en utilisant l'interface web. Il peut être mis à jour en utilisant l'interface web.

source: enable creation of users from LDAP when the credential are valid.
fr: permet la création d'utilisateurs à partir de LDAP lorsque les informations d'identification sont valides.

source: default role used when creating users from LDAP. This parameter is only useful when `--add-missing-user` is enabled.
fr: rôle par défaut utilisé lors de la création d'utilisateurs à partir de LDAP. Ce paramètre n'est utile que lorsque l'option `--add-missing-user` est activée.

source: URL to the LDAP server used to validate user credentials. e.g.: ldap://localhost:389
fr: URL du serveur LDAP utilisé pour valider les informations d'identification de l'utilisateur, par exemple : ldap://localhost:389

source: DN of the branch of the directory where all searches should start from. e.g.: dc=my,dc=domain
fr: DN de la branche de l'annuaire à partir de laquelle toutes les recherches doivent être effectuées, par exemple : dc=my,dc=domain

source: scope of the search. Can be either base, onelevel or subtree
fr: champ d'application de la recherche. Il peut s'agir de: base, onelevel or subtree

source: The attribute to search username. If no attributes are provided, the default is to use `uid`. It's a good idea to choose an attribute that will be unique across all entries in the subtree you will be using.
fr: L'attribut à rechercher dans le nom d'utilisateur. Si aucun attribut n'est fourni, la valeur par défaut est `uid`. Il est conseillé de choisir un attribut qui sera unique pour toutes les entrées du sous-arbre que vous utiliserez.

source: search filter to limit LDAP lookup. If not provided, defaults to `(objectClass=*)`, which searches for all objects in the tree. For improved performance it's recommanded to narrow the search to your user object class. e.g.: `(objectClass=posixAccount)`
fr: search filter pour limiter la recherche LDAP. S'il n'est pas fourni, la valeur par défaut est `(objectClass=*)`, qui recherche tous les objets de l'arbre. Pour améliorer les performances, il est recommandé de restreindre la recherche à la classe d'objet de l'utilisateur, par exemple : `(objectClass=posixAccount)`

source: list of CN of the group(s) containing administrator. Not cn=groupname or the full DN.
fr: liste des CN des groupes contenant l'administrateur. Pas cn=groupname ou le DN complet.

source: list of CN of the group(s) containing Subnet Managers. Not cn=groupname or the full DN.
fr: liste des CN du (des) groupe(s) contenant les gestionnaires de sous-réseau. Pas le DN complet.

source: list of CN of the group(s) containing DNS Zone Managers. Not cn=groupname or the full DN.
fr: liste des NC du (des) groupe(s) contenant les gestionnaires de zone DNS. Pas le DN complet.

source: list of CN of the group(s) containing Users. Not cn=groupname or the full DN.
fr: liste des NC du (des) groupe(s) contenant les utilisateurs. Pas le DN complet.

source: list of CN of the group(s) containing Guests. Not cn=groupname or the full DN.
fr: liste des CN du (des) groupe(s) contenant les Guests. Pas le DN complet.

source: search filter to limit LDAP lookup of groups. If not provided, defaults to `(objectClass=*)`, which searches for all objects in the tree. For improved performance it's recommanded to narrow the search to your group object class. e.g.: `(objectClass=posixGroup)`
fr: filtre de recherche pour limiter la recherche LDAP des groupes. S'il n'est pas fourni, la valeur par défaut est `(objectClass=*)`, qui recherche tous les objets de l'arbre. Pour améliorer les performances, il est recommandé de restreindre la recherche à la classe d'objet de vos groupes, par exemple : `(objectClass=posixGroup)`

source: name of the attribute on the Group that hold the list of members. Default: `member`. Other common value is: `memberUid`
fr: nom de l'attribut du groupe qui contient la liste des membres. Valeur par défaut : `member`. Une autre valeur courante est : `memberUid`

source: True If the group contains list of user defined with DN instead of username.
fr: True Si le groupe contient une liste d'utilisateurs définis avec un DN au lieu d'un nom d'utilisateur.

source: optional DN used to bind to the server when searching for entries. If not provided, will use an anonymous bind.
fr: DN optionnel utilisé pour se lier au serveur lors de la recherche d'entrées. S'il n'est pas fourni, un lien anonyme sera utilisé.

source: password to use in conjunction with `--ldap-bind-dn`. Note that the bind password is probably sensitive data, and should be properly protected. You should only use the `--ldap-bind-dn` and `--ldap-bind-password` if you absolutely need them to search the directory.
fr: mot de passe à utiliser en conjonction avec `--ldap-bind-dn`. Notez que le mot de passe de liaison est probablement une donnée sensible, et doit être correctement protégé. Vous ne devriez utiliser les options `--ldap-bind-dn` et `--ldap-bind-password` que si vous en avez absolument besoin pour effectuer des recherches dans l'annuaire.

source: version of LDAP in use either 2 or 3. Default to 3.
fr: version de LDAP utilisée, soit 2, soit 3. La valeur par défaut est 3.

source: timeout in seconds value used for LDAP connection
fr: timeout en secondes valeur utilisée pour la connexion LDAP

source: timeout in seconds value used for LDAP request
fr: timeout en secondes valeur utilisée pour la requête LDAP

source: encoding used by your LDAP server.
fr: encodage utilisé par votre serveur LDAP.

source: LDAP attribute for user display name. If `fullname` is blank, the fullname is taken from the `firstname` and `lastname`. Attributes 'cn', or 'displayName' commonly carry full names.
fr: Attribut LDAP pour le nom d'affichage de l'utilisateur. Si `fullname` est vide, le nom complet est pris à partir de `firstname` et `lastname`. Les attributs 'cn' ou 'displayName' contiennent généralement des noms complets.

source: LDAP attribute for user first name. Used when the attribute configured for name does not exist. e.g.: `givenName`
fr: Attribut LDAP pour le prénom de l'utilisateur. Utilisé lorsque l'attribut configuré pour le nom n'existe pas. ex : `givenName`

source: LDAP attribute for user last name. Used when the attribute configured for name does not exist. e.g.: `sn`
fr: Attribut LDAP pour le nom de famille de l'utilisateur. Utilisé lorsque l'attribut configuré pour le nom n'existe pas. ex : `sn`

source: LDAP attribute for user email. e.g.: mail, email, userPrincipalName
fr: Attribut LDAP pour l'email de l'utilisateur. ex : mail, email, userPrincipalName

source: SMTP server used to send email.
fr: Serveur SMTP utilisé pour envoyer du courrier électronique.

source: Username used to authenticated with the SMTP server.
fr: Le nom d'utilisateur est utilisé pour s'authentifier auprès du serveur SMTP.

source: Password used to authenticated with the SMTP server.
fr: Mot de passe utilisé pour s'authentifier auprès du serveur SMTP.

source: Email address used to send email.
fr: Adresse électronique utilisée pour envoyer le courrier électronique.

source: type of encryption to be used when establishing communication with SMTP server: none, ssl, starttls
fr: type de cryptage à utiliser lors de l'établissement de la communication avec le serveur SMTP: non, ssl, starttls

source: When defined, all notification email will be sent to this email address.
fr: Lorsque cette option est définie, tous les courriels de notification seront envoyés à cette adresse électronique.

source: Name used in the title for this application.
fr: Nom utilisé dans le titre de cette application.

source: Text displayed in the footer along "power by".
fr: Texte affiché dans le pied de page à côté de "power by".

source: URL used in the footer along "power by".
fr: URL utilisée dans le pied de page avec "power by".

source: Minimum zxcvbn's score for password. Value from 1 to 4. Default value 2. Read more about it here: https://github.com/dropbox/zxcvbn
fr: Note minimale de zxcvbn pour le mot de passe. Valeur de 1 à 4. Valeur par défaut : 2. Pour en savoir plus : https://github.com/dropbox/zxcvbn

source: Force a specific umask value. Usually expressed in octal format, for example, ``0022``. Default value is inherit from parent process.
fr: Forcer une valeur d'umask spécifique. Généralement exprimée au format octal, par exemple, ``0022``. La valeur par défaut est héritée du processus parent.

source: User under which the server will answer requests. In order to use this directive, the process must be run initially as root. If you start the server as a non-root user, it will fail to change to the lesser privileged user, and will instead continue to run as that original user.
fr: Utilisateur sous lequel le serveur répondra aux requêtes. Pour utiliser cette directive, le processus doit être lancé initialement en tant que root. Si vous démarrez le serveur en tant qu'utilisateur non root, il ne passera pas à l'utilisateur moins privilégié et continuera à fonctionner en tant qu'utilisateur d'origine.

source: Group under which the server will answer requests. In order to use this directive, the process must be run initially as root.
fr: Groupe sous lequel le serveur répondra aux demandes. Pour pouvoir utiliser cette directive, le processus doit être exécuté initialement en tant qu'utilisateur root.

source: Invalid value: %s
fr: Valeur invalide : %s

source: Database error: %s
fr: Erreur de base de données : %s

source: Database integrity error: %s
fr: Erreur d'intégrité de la base de données : %s

source: Show related record
fr: Afficher l'enregistrement associé

source: Field(s):
fr: Champ(s) :

source: Invalid column for sorting
fr: Colonne non valide pour le tri

source: System
fr: Système

source: Add a comments
fr: Ajouter un commentaire

source: Record created successfully.
fr: Enregistrement créé avec succès.

source: Record updated successfully
fr: L'enregistrement a été mis à jour avec succès

source: Enter an IPv4 or IPv6 address
fr: Saisir une adresse IPv4 ou IPv6

source: Determined automatically if left blank.
fr: Déterminé automatiquement si laissé vide.

source: Enter a MAC address
fr: Saisir une adresse MAC

source: Enter details information about this DHCP Reservation
fr: Saisir des informations détaillées sur cette réservation DHCP

source: Owner
fr: Propriétaire

source: Name
fr: Nom

source: Enter a FQDN
fr: Saisir un FQDN

source: TTL must be at least %(min)s.
fr: Le TTL doit être au moins %(min)s.

source: Time-to-live value (default: 3600)
fr: Valeur du temps de vie (par défaut : 3600)

source: Time to live in seconds.
fr: Durée de vie en secondes.

source: Value
fr: Valeur

source: Enter details information about this subnet
fr: Saisir des informations détaillées sur ce sous-réseau

source: Create Reverse DNS Record
fr: Créer un enregistrement DNS inverse

source: Create Forward DNS Record
fr: Création d'un enregistrement DNS direct (Forward DNS Record)

source: Reverse DNS Record created.
fr: Enregistrement DNS inversé créé.

source: Cannnot create Reverse DNS Record.
fr: Impossible de créer un enregistrement DNS inverse.

source: Allowed subnets
fr: Sous-réseaux autorisés

source: Available
fr: Disponible

source: Selected
fr: Sélectionné

source: Filter...
fr: Filtre...

source: Enter details information about this DNS Zone
fr: Saisir des informations détaillées sur cette zone DNS

source: Environment Name
fr: Nom de l'environnement

source: Data Type
fr: Type de données

source: Enter command lines used to deploy in this environment.
fr: Saisir les lignes de commande utilisées pour le déploiement dans cet environnement.

source: Enter details information about this environment
fr: Saisir des informations détaillées sur cet environnement

source: Subnets
fr: Sous-réseaux

source: DNS Records
fr: Enregistrements DNS

source: DHCP Reservation
fr: Réservation DHCP

source: Your shell script can use some of the predefined environment variables: %s.
fr: Votre script shell peut utiliser certaines des variables d'environnement prédéfinies : %s.

source: Deploy pending changes
fr: Déploiement en attente de modifications

source: Disabled
fr: Désactivé

source: Deleted
fr: Supprimé

source: IP Ranges
fr: Plages d'IP

source: DHCP enabled
fr: DHCP activé

source: DNS zones
fr: Zones DNS

source: IP Address
fr: Adresse IP

source: Related DNS Records
fr: Enregistrements DNS associés

source: Related DHCP Reservations
fr: Réservations DHCP associées

source: Enter details information about this IP Address
fr: Saisir des informations détaillées sur cette adresse IP

source: activate to sort column ascending
fr: activer pour trier les colonnes en ordre croissant

source: activate to sort column descending
fr: activer le tri des colonnes en ordre décroissant

source: Previous
fr: Précédent

source: Next
fr: Suivant

source: %d years ago
fr: Il y a %d ans

source: %d months ago
fr: Il y a %d mois

source: %d days ago
fr: Il y a %d jours

source: %d hours ago
fr: Il y a %d heures

source: %d minutes ago
fr: Il y a %d minutes

source: %d seconds ago
fr: Il y a %d secondes

source: Created by
fr: Créé par

source: Modified by
fr: Modifié par

source: Comment on
fr: Commentaire sur

source: Enabled
fr: Activé

source: No
fr: Non

source: Yes
fr: Oui

source: Status
fr: État

source: RIR Status
fr: État RIR

source: Allowed DNS zone(s)
fr: Zone(s) DNS autorisée(s)

source: SQL Statement
fr: Déclaration SQL

source: Built-in
fr: Intégré

source: Enforced
fr: Imposée

source: Username
fr: Nom d'utilisateur

source: Password
fr: Mot de passe

source: Role
fr: Rôle

source: Fullname
fr: Nom complet

source: Email
fr: Courriel

source: Preferred Language
fr: Langue préférée

source: Preferred Time zone
fr: Fuseau horaire préféré

source: Two-Factor authentication
fr: Authentification à deux facteurs

source: Showing total of _TOTAL_
fr: Affiche un total de _TOTAL_ entrées

source: (filtered from _MAX_ total entries)
fr: (filtrés à partir de _MAX_ entrées totales)

source: - No records available
fr: - Aucun enregistrement

source: Show _MENU_ entries
fr: Affiche _MENU_ entrées

source: Loading...
fr: Chargement...

source: Filter:
fr: Filtre :

source: List is empty
fr: La liste est vide

source: Subnet file
fr: Fichier de sous-réseau

source: CSV File
fr: Fichier CSV

source: Fail to process the given file.
fr: Échec du traitement du fichier donné.

source: Line:
fr: Ligne :

source: Row:
fr: Rangée :

source: CSV File imported with success !
fr: Fichier CSV importé avec succès !

source: invalid redirect url
fr: url de redirection invalide

source: Enter a valid email address
fr: Entrez une adresse e-mail valide

source: Enter password
fr: Entrez votre mot de passe

source: Remember me
fr: Se souvenir de moi

source: Sign in
fr: Se connecter

source: Invalid credentials
fr: Informations d'identification invalides

source: MAC Address
fr: Adresse MAC

source: Enter details information about this MAC Address
fr: Entrez des informations détaillées sur cette adresse MAC

source: Verification code
fr: Code de vérification

source: Enter verification code here
fr: Entrez le code de vérification ici

source: Resend code to my email
fr: Renvoyer le code à mon e-mail

source: Invalid verification code.
fr: Code de vérification invalide.

source: Invalid operation
fr: Opération non valide

source: Multi-factor authentication is enabled for your account, but your account does not have a valid email address to send the verification code to. Check your account settings with your administrator.
fr: L'authentification multi-facteur est activée pour votre compte, mais celui-ci ne dispose pas d'une adresse électronique valide à laquelle envoyer le code de vérification. Vérifiez les paramètres de votre compte auprès de votre administrateur.

source: A new verification code has been sent to your email.
fr: Un nouveau code de vérification a été envoyé à votre adresse électronique.

source: Notification settings updated successfully.
fr: Les paramètres de notification ont été mis à jour avec succès.

source: Enable
fr: Activer

source: Disable
fr: Désactiver

source: Two-Factor authentication enabled successfully.
fr: L'authentification à deux facteurs a été activée avec succès.

source: Two-Factor authentication disabled successfully.
fr: Authentification à deux facteurs désactivée avec succès.

source: Enter the verification code to continue.
fr: Saisissez le code de vérification pour continuer.

source: To continue, you must set up an email address for your account.
fr: Pour continuer, vous devez créer une adresse électronique pour votre compte.

source: This setting only affects email notifications. For all other dates, your browser's timezone is used for display.
fr: Ce paramètre n'affecte que les notifications par courrier électronique. Pour toutes les autres dates, le fuseau horaire de votre navigateur est utilisé pour l'affichage.

source: (default)
fr: (par défaut)

source: Current password
fr: Mot de passe actuel

source: Current password is missing.
fr: Le mot de passe actuel est manquant.

source: You must provide your current password in order to change it.
fr: Vous devez fournir votre mot de passe actuel pour le modifier.

source: New password
fr: Nouveau mot de passe

source: New password is missing.
fr: Le nouveau mot de passe est manquant.

source: The new password and its confirmation do not match.
fr: Le nouveau mot de passe et sa confirmation ne correspondent pas.

source: Password confirmation
fr: Confirmation du mot de passe

source: Confirmation password is missing.
fr: Le mot de passe de confirmation est manquant.

source: Cannot update password for non-local user. Contact your administrator for more detail.
fr: Impossible de mettre à jour le mot de passe d'un utilisateur non local. Contactez votre administrateur pour plus de détails.

source: Current password is not valid.
fr: Le mot de passe actuel n'est pas valide.

source: User profile updated successfully.
fr: Le profil de l'utilisateur a été mis à jour avec succès.

source: Rule Identifier
fr: Identifiant de la règle

source: Enforced rule prevent record from being saved.
fr: Une règle imposée empêche la sauvegarde de l'enregistrement.

source: Built-in rules are predefined, unmodifiable constraints integral to the application's functionality.
fr: Les règles intégrées sont des contraintes prédéfinies et non modifiables qui font partie intégrante de la fonctionnalité de l'application.

source: Description
fr: Saisir une description

source: Description of the rule.
fr: Description de la règle.

source: SQL Statement returning list of invalid records.
fr: Déclaration SQL renvoyant la liste des enregistrements non valides.

source: The SQL statement should return a row for each invalid record. The columns should be labeled: id, name.
fr: L'instruction SQL doit renvoyer une ligne pour chaque enregistrement invalide. Les colonnes doivent être intitulées : id, name.

source: Enter details information about this Rule
fr: Saisir des informations détaillées sur cette règle

source: 174.95.0.0/16 or 2001:0db8:85a3::/64
fr: 174.95.0.0/16 ou 2001:0db8:85a3::/64

source: DHCP Enabled
fr: DHCP activé

source: DHCP Start
fr: DHCP début

source: Leave blank for default
fr: Laisser vide pour la valeur par défaut

source: DHCP Stop
fr: DHCP fin

source: %s is not a valid IPv4 or IPv6 range
fr: %s n'est pas une plage IPv4 ou IPv6 valide

source: %s is not a valid IPv4 or IPv6 address
fr: %s n'est pas une adresse IPv4 ou IPv6 valide

source: DHCP start must be defined within the subnet range
fr: L'address de départ DHCP doit être défini dans la plage de sous-réseaux

source: DHCP end must be defined within the subnet range
fr: L'address de fin DHCP doit être défini dans la plage de sous-réseaux

source: DHCP end must be greather than DHCP start
fr: L'adresse IP de fin de DHCP doit être supérieure à l'adresse IP de début de DHCP

source: Enter a description
fr: Saisir une description
